from django.core.management.base import BaseCommand, CommandError
from AboutMeApp.models import Work,Study,Hobby,UserInfo, Organization, EducationalOrganization
from datetime import date


class Command(BaseCommand):
        help = "Fill DB test data"

        def handle(self, *args, **options):
            fixtures = [
                 {
                    'object': Organization,
                    'data': [
                        {
                            'name': 'ООО "ИСС Дистрибьюшн"',
                            'site': 'http://eset.ru/',
                            'place': 'г.Москва',
                            'phone': '+7 (499) 345-67-84',
                            "desc": "\u0420\u043e\u0441\u0441\u0438\u0439\u0441\u043a\u043e\u0435 \u043f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u0438\u0442\u0435\u043b\u044c\u0441\u0442\u0432\u043e ESET(\u041e\u041e\u041e \u0418\u0421\u0421 \u0414\u0438\u0441\u0442\u0440\u0438\u0431\u044c\u044e\u0448\u043d) \u043e\u0442\u043a\u0440\u044b\u043b\u043e\u0441\u044c \u0432 \u044f\u043d\u0432\u0430\u0440\u0435 2005 \u0433\u043e\u0434\u0430 \u0438 \u0432\u0445\u043e\u0434\u0438\u0442 \u0432 \u0442\u0440\u043e\u0439\u043a\u0443 \u0441\u0442\u0440\u0430\u0442\u0435\u0433\u0438\u0447\u0435\u0441\u043a\u0438 \u0432\u0430\u0436\u043d\u044b\u0445 \u043f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u0438\u0442\u0435\u043b\u044c\u0441\u0442\u0432 \u043a\u043e\u043c\u043f\u0430\u043d\u0438\u0438 \u0432 \u043c\u0438\u0440\u0435. \u0420\u043e\u0441\u0441\u0438\u0439\u0441\u043a\u043e\u0435 \u043f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u0438\u0442\u0435\u043b\u044c\u0441\u0442\u0432\u043e ESET \u0442\u0430\u043a\u0436\u0435 \u043a\u0443\u0440\u0438\u0440\u0443\u0435\u0442 \u043f\u0440\u043e\u0434\u0432\u0438\u0436\u0435\u043d\u0438\u0435 \u0438 \u043f\u0440\u043e\u0434\u0430\u0436\u0443 \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u043c\u043d\u043e\u0433\u043e \u043e\u0431\u0435\u0441\u043f\u0435\u0447\u0435\u043d\u0438\u044f ESET \u0432 \u0441\u0442\u0440\u0430\u043d\u0430\u0445 \u0421\u041d\u0413. \u041d\u0430 \u0441\u0435\u0433\u043e\u0434\u043d\u044f\u0448\u043d\u0438\u0439 \u0434\u0435\u043d\u044c \u0440\u0435\u0433\u0438\u043e\u043d\u0430\u043b\u044c\u043d\u044b\u0435 \u043e\u0444\u0438\u0441\u044b \u043a\u043e\u043c\u043f\u0430\u043d\u0438\u0438 \u043e\u0442\u043a\u0440\u044b\u0442\u044b \u0432 \u041c\u043e\u0441\u043a\u0432\u0435, \u0421\u0430\u043d\u043a\u0442-\u041f\u0435\u0442\u0435\u0440\u0431\u0443\u0440\u0433\u0435, \u0421\u0430\u043c\u0430\u0440\u0435, \u0415\u043a\u0430\u0442\u0435\u0440\u0438\u043d\u0431\u0443\u0440\u0433\u0435, \u041a\u0440\u0430\u0441\u043d\u043e\u0434\u0430\u0440\u0435, \u041d\u043e\u0432\u043e\u0441\u0438\u0431\u0438\u0440\u0441\u043a\u0435 \u0438 \u0410\u043b\u043c\u0430\u0442\u044b \u0441\u043e \u0448\u0442\u0430\u0442\u043e\u043c \u0431\u043e\u043b\u0435\u0435 100 \u0447\u0435\u043b\u043e\u0432\u0435\u043a. \u041f\u043e \u0434\u0430\u043d\u043d\u044b\u043c \u0438\u0441\u0441\u043b\u0435\u0434\u043e\u0432\u0430\u0442\u0435\u043b\u044c\u0441\u043a\u0438\u0445 \u043a\u043e\u043c\u043f\u0430\u043d\u0438\u0439 \u041a\u041e\u041c\u041a\u041e\u041d \u0438 \u00ab\u0420\u043e\u043c\u0438\u0440\u00bb, ESET NOD32 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u0432\u0442\u043e\u0440\u044b\u043c \u043f\u043e \u043f\u043e\u043f\u0443\u043b\u044f\u0440\u043d\u043e\u0441\u0442\u0438 \u0430\u043d\u0442\u0438\u0432\u0438\u0440\u0443\u0441\u043d\u044b\u043c \u0440\u0435\u0448\u0435\u043d\u0438\u0435\u043c \u0432 \u0420\u043e\u0441\u0441\u0438\u0438 \u0438 \u0437\u0430\u0449\u0438\u0449\u0430\u0435\u0442 \u043a\u0430\u0436\u0434\u044b\u0439 \u0442\u0440\u0435\u0442\u0438\u0439 \u043a\u043e\u043c\u043f\u044c\u044e\u0442\u0435\u0440. \u041f\u0440\u0438 \u044d\u0442\u043e\u043c 90% \u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u0435\u043b\u0435\u0439 \u0440\u0435\u043a\u043e\u043c\u0435\u043d\u0434\u0443\u044e\u0442 \u043f\u0440\u043e\u0434\u0443\u043a\u0442\u044b ESET NOD32 \u0441\u0432\u043e\u0438\u043c \u0434\u0440\u0443\u0437\u044c\u044f\u043c \u0438 \u0437\u043d\u0430\u043a\u043e\u043c\u044b\u043c.",
                            "logo": "eset_logo.png",
                        },
                        {
                            'name': 'ЗАО "Связной Логистика"',
                            'site': 'http://www.svyaznoy.ru/', 'place': 'г.Екатеринбург',
                            'phone': '+7 (499) 001-67-82',
                            "logo": "svz_logo.png",
                            "desc": "\u0421\u0432\u044f\u0437\u043d\u043e\u0439\u00bb \u2014 \u0440\u043e\u0441\u0441\u0438\u0439\u0441\u043a\u0430\u044f \u043a\u043e\u043c\u043f\u0430\u043d\u0438\u044f, \u0444\u0435\u0434\u0435\u0440\u0430\u043b\u044c\u043d\u0430\u044f \u0440\u043e\u0437\u043d\u0438\u0447\u043d\u0430\u044f \u0441\u0435\u0442\u044c, \u0441\u043f\u0435\u0446\u0438\u0430\u043b\u0438\u0437\u0438\u0440\u0443\u044e\u0449\u0430\u044f\u0441\u044f \u043d\u0430 \u043f\u0440\u043e\u0434\u0430\u0436\u0435 \u0443\u0441\u043b\u0443\u0433 \u0441\u043e\u0442\u043e\u0432\u044b\u0445 \u043e\u043f\u0435\u0440\u0430\u0442\u043e\u0440\u043e\u0432 \u0438 \u043f\u0440\u043e\u0432\u0430\u0439\u0434\u0435\u0440\u043e\u0432 \u043f\u0440\u043e\u0432\u043e\u0434\u043d\u043e\u0433\u043e \u0434\u043e\u0441\u0442\u0443\u043f\u0430 \u0432 \u0438\u043d\u0442\u0435\u0440\u043d\u0435\u0442, \u043f\u0435\u0440\u0441\u043e\u043d\u0430\u043b\u044c\u043d\u044b\u0445 \u0441\u0440\u0435\u0434\u0441\u0442\u0432 \u0441\u0432\u044f\u0437\u0438, \u0430\u043a\u0441\u0435\u0441\u0441\u0443\u0430\u0440\u043e\u0432, \u043f\u043e\u0440\u0442\u0430\u0442\u0438\u0432\u043d\u043e\u0439 \u0446\u0438\u0444\u0440\u043e\u0432\u043e\u0439 \u0430\u0443\u0434\u0438\u043e- \u0438 \u0444\u043e\u0442\u043e\u0442\u0435\u0445\u043d\u0438\u043a\u0438."
                        },
                        {
                            'name': 'ООО "Рамблер"',
                            'site': 'https://rambler-co.ru', 'place': 'г.Барнаул',
                            'phone': '+7 (499) 345-67-84',
                            "logo": "rambler_logo.png", "desc": "Rambler&Co \u2014 \u043e\u0434\u043d\u0430 \u0438\u0437 \u043a\u0440\u0443\u043f\u043d\u0435\u0439\u0448\u0438\u0445 \u0440\u043e\u0441\u0441\u0438\u0439\u0441\u043a\u0438\u0445 \u0433\u0440\u0443\u043f\u043f \u043a\u043e\u043c\u043f\u0430\u043d\u0438\u0439, \u0440\u0430\u0431\u043e\u0442\u0430\u044e\u0449\u0438\u0445 \u0432 \u043e\u0431\u043b\u0430\u0441\u0442\u0438 \u043c\u0435\u0434\u0438\u0430, \u0442\u0435\u0445\u043d\u043e\u043b\u043e\u0433\u0438\u0439 \u0438 \u044d\u043b\u0435\u043a\u0442\u0440\u043e\u043d\u043d\u043e\u0439 \u043a\u043e\u043c\u043c\u0435\u0440\u0446"
                        },
                        {
                            'name': 'ООО "Тест 4"',
                            "name": "Microsoft",
                                "site": "https://test.com",
                                "place": "Редмонд, Вашингтон, США",
                                "phone": "+7 (499) 345-67-84",
                                "logo": "microsoft.png",
                                "desc": "Microsoft Corporation (читается ма́йкрософт корпоре́йшн; как правило, упоминается просто как Microsoft; распространено сокращение MS) — одна из крупнейших транснациональных компаний по производству проприетарного программного обеспечения для различного рода вычислительной техники — персональных компьютеров, игровых приставок, КПК, мобильных телефонов и прочего, разработчик наиболее широко распространённой на данный момент в мире программной платформы — семейства операционных систем Windows."
                        },
                        {"name": "Apple", "site": "https://example.ru",
                            "place": "Купертино, Калифорния, США",
                            "phone": "+7 (499) 345-67-84", "logo": "apple.png",
                            "desc": "Apple Inc. — американская корпорация, производитель персональных и планшетных компьютеров, аудиоплееров, телефонов, программного обеспечения."
                        }
                    ]
                }, {'object': EducationalOrganization, 'data': [
                    {
                        'name': '(\u041c\u0413\u0423\u041f\u041f) \u041c\u043e\u0441\u043a\u043e\u0432\u0441\u043a\u0438\u0439 \u0433\u043e\u0441\u0443\u0434\u0430\u0440\u0441\u0442\u0432\u0435\u043d\u043d\u044b\u0439 \u0443\u043d\u0438\u0432\u0435\u0440\u0441\u0438\u0442\u0435\u0442 \u043f\u0438\u0449\u0435\u0432\u044b\u0445 \u043f\u0440\u043e\u0438\u0437\u0432\u043e\u0434\u0441\u0442\u0432 \u041c\u0438\u043d\u0438\u0441\u0442\u0435\u0440\u0441\u0442\u0432\u0430 \u043e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d\u0438\u044f \u0420\u043e\u0441\u0441\u0438\u0439\u0441\u043a\u043e\u0439 \u0424\u0435\u0434\u0435\u0440\u0430\u0446\u0438\u0438"',
                        'site': 'http://www.mgupp.ru/',
                        'address': 'г.Москва, ш. Волоколамское, 11',
                        'phone': '+7 (499) 345-67-84',
                        'logo': 'mgupp_logo.png',
                        "desc": 'Крупнейший технический вуз России по подготовке специалистов для пищевых и перерабатывающих отраслей АПК и биотехнологической промышленности.'
                    }]},
                {
                    'object': Work,
                    'data': [
                        {
                            "organization": 1,
                            "position": "Team Lead",
                            "desc": """Российское представительство ESET(ООО ИСС Дистрибьюшн) открылось в январе 2005 года и входит в тройку стратегически важных представительств компании в мире. Российское представительство ESET также курирует продвижение и продажу программного обеспечения ESET в странах СНГ. На сегодняшний день региональные офисы компании открыты в Москве, Санкт-Петербурге, Самаре, Екатеринбурге, Краснодаре, Новосибирске и Алматы со штатом более 100 человек. По данным исследовательских компаний КОМКОН и «Ромир», ESET NOD32 является вторым по популярности антивирусным решением в России и защищает каждый третий компьютер. При этом 90% пользователей рекомендуют продукты ESET NOD32 своим друзьям и знакомым.""",
                            "date_start": "2011-3-1",
                            "date_finish": "2013-4-1",
                        },
                        {
                            "organization": 2,
                            "position": "Team Lead",
                            "desc": "Связной» — российская компания, федеральная розничная сеть, специализирующаяся на продаже услуг сотовых операторов и провайдеров проводного доступа в интернет, персональных средств связи, аксессуаров, портативной цифровой аудио- и фототехники.",
                            "date_start": "2013-4-1",
                            "date_finish": "2013-11-1",
                        },
                        {
                            "organization": 3,
                            "position": "Head of IT Department",
                            "desc": "Rambler&Co — одна из крупнейших российских групп компаний, работающих в области медиа, технологий и электронной коммерц",
                            "date_start": "2013-11-1",
                            "date_finish": None,
                        }, {"organization": 4,
                            "position": "Team Lead",
                            "desc": """выаываываыв""",
                            "date_start": "2011-3-1",
                            "date_finish": "2013-4-1",},
                        {"organization": 4,
                            "position": "Team Lead",
                            "desc": """впвыывп""",
                            "date_start": "2011-3-1",
                            "date_finish": "2013-4-1",},
                    ]
                },
                {
                    'object': Hobby,
                    'data': [{"name": "Программирование", "ico_fa": "code"},
                        {"name": "Велоспорт", "ico_fa": "bicycle"},
                        {"name": "Авто", "ico_fa": "car"}
                    ]
                },
                {
                    'object': Study,
                    'data': [
                        {
                            "educational_organization": 1,
                            "faculty": "Институт информационных технологий, автоматизированных систем и технологического оборудования",
                            "specialty": "230100: Информатика и вычислительная техника",
                            "degree": "Высшее (бакалавр), Дневная/Очная форма обучения.",
                            "date_start": "2008-9-1",
                            "date_finish": "2012-7-20",
                        },
                        {
                            "educational_organization": 1,
                            "faculty": "Институт информационных технологий, автоматизированных систем и технологического оборудования",
                            "specialty": "230100: Информатика и вычислительная техника",
                            "degree": "Высшее (магистр), Дневная/Очная форма обучения.",
                            "date_start": "2012-9-1",
                            "date_finish": "2014-7-20",
                        }
                    ]
                },
                {
                    'object': UserInfo,
                    'data': [
                        {"date_birthday": "1991-1-3",
                            "first_name": "Артём",
                            "last_name": "Леонтьев",
                            "second_name": "Пупырышкин",
                            "place_birthday": "г.Сыктывкар",
                        }
                    ]
                }
            ]

            for fixture in fixtures:
                if 'object' in fixture and 'data' in fixture:
                    for rec in fixture['data']:
                        if type(rec) is dict:
                            try:
                                if fixture['object'] is Work:
                                    rec['organization'] = Organization.objects.get(id=rec['organization'])

                                if fixture['object'] is Study:
                                    rec['educational_organization'] = EducationalOrganization.objects.get(id=rec['educational_organization'])

                                el = fixture['object'](**rec)
                                el.save()
                            except Exception as e:
                                print(e, fixture['object'])
                                continue

                            if fixture['object'] is UserInfo:
                                el.hobbies.add(1, 2, 3)